digint/openmptl/arch/arm/cortex-m3/stm32f10x/include/arch/core_reg.hpp
  static constexpr reg_addr_t DMA1_BASE             = AHBPERIPH_BASE + 0x0000;
  static constexpr reg_addr_t DMA1_Channel1_BASE    = AHBPERIPH_BASE + 0x0008;
  static constexpr reg_addr_t DMA1_Channel2_BASE    = AHBPERIPH_BASE + 0x001C;
  static constexpr reg_addr_t DMA1_Channel3_BASE    = AHBPERIPH_BASE + 0x0030;
  static constexpr reg_addr_t DMA1_Channel4_BASE    = AHBPERIPH_BASE + 0x0044;
  static constexpr reg_addr_t DMA1_Channel5_BASE    = AHBPERIPH_BASE + 0x0058;
  static constexpr reg_addr_t DMA1_Channel6_BASE    = AHBPERIPH_BASE + 0x006C;
  static constexpr reg_addr_t DMA1_Channel7_BASE    = AHBPERIPH_BASE + 0x0080;
  static constexpr reg_addr_t DMA2_BASE             = AHBPERIPH_BASE + 0x0400;
  static constexpr reg_addr_t DMA2_Channel1_BASE    = AHBPERIPH_BASE + 0x0408;
  static constexpr reg_addr_t DMA2_Channel2_BASE    = AHBPERIPH_BASE + 0x041C;
  static constexpr reg_addr_t DMA2_Channel3_BASE    = AHBPERIPH_BASE + 0x0430;
  static constexpr reg_addr_t DMA2_Channel4_BASE    = AHBPERIPH_BASE + 0x0444;
  static constexpr reg_addr_t DMA2_Channel5_BASE    = AHBPERIPH_BASE + 0x0458;
  static constexpr reg_addr_t RCC_BASE              = AHBPERIPH_BASE + 0x1000;
  static constexpr reg_addr_t CRC_BASE              = AHBPERIPH_BASE + 0x3000;

  static constexpr reg_addr_t FLASH_BASE            = AHBPERIPH_BASE + 0x2000; /**< Flash registers base address      */
  static constexpr reg_addr_t OB_BASE               = 0x1FFFF800;              /**< Flash Option Bytes base address   */

  static constexpr reg_addr_t ETH_BASE              = AHBPERIPH_BASE + 0x8000;
  static constexpr reg_addr_t ETH_MAC_BASE          = ETH_BASE;
  static constexpr reg_addr_t ETH_MMC_BASE          = ETH_BASE + 0x0100;
  static constexpr reg_addr_t ETH_PTP_BASE          = ETH_BASE + 0x0700;
  static constexpr reg_addr_t ETH_DMA_BASE          = ETH_BASE + 0x1000;

  static constexpr reg_addr_t FSMC_Bank1_R_BASE     = FSMC_R_BASE + 0x0000; /**< FSMC Bank1 registers base address    */
  static constexpr reg_addr_t FSMC_Bank1E_R_BASE    = FSMC_R_BASE + 0x0104; /**< FSMC Bank1E registers base address   */
  static constexpr reg_addr_t FSMC_Bank2_R_BASE     = FSMC_R_BASE + 0x0060; /**< FSMC Bank2 registers base address    */
  static constexpr reg_addr_t FSMC_Bank3_R_BASE     = FSMC_R_BASE + 0x0080; /**< FSMC Bank3 registers base address    */
  static constexpr reg_addr_t FSMC_Bank4_R_BASE     = FSMC_R_BASE + 0x00A0; /**< FSMC Bank4 registers base address    */

  static constexpr reg_addr_t DBGMCU_BASE           = 0xE0042000; /**< Debug MCU registers base address   */
};


////////////////////  CoreRegister  ////////////////////


class CoreRegister {

public:

  using access = RegisterAccess;

  /**
   * System Control Register
   *
   * Imported from the Cortex-M3 Technical Reference Manual  (Revision: r2p1)
   * <http://infocenter.arm.com/help/topic/com.arm.doc.subset.cortexm.m3/index.html>
   */
  class SCB
  {
    /**
     * SysTick Control and Status Register
     */
    template<typename R>
    struct __STCSR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > ENABLE;        /**< [ 0: 0] Counter enable                                 */
      typedef RegisterBits< R,  1,  1 > TICKINT;       /**< [ 1: 1] Counting down to 0 pends the SysTick handler   */
      typedef RegisterBits< R,  2,  1 > CLKSOURCE;     /**< [ 2: 2] Clock source                                   */
      typedef RegisterBits< R, 16,  1 > COUNTFLAG;     /**< [16:16] Count Flag                                     */
    };

    /**
     * SysTick Calilbration Value Register
     */
    template<typename R>
    struct __STCR
    : public R
    {
      typedef RegisterBits< R, 30,  1 > SKEW;          /**< [30:30] Calibration value is not exactly 10 ms   */
      typedef RegisterBits< R, 31,  1 > NOREF;         /**< [31:31] The reference clock is not provided      */
    };

    /**
     * CPUID Base Register, CPUID
     */
    template<typename R>
    struct __CPUID
    : public R
    {
      typedef RegisterBits< R,  0,  4 > REVISION;      /**< [ 3: 0] Implementation defined revision number   */
      typedef RegisterBits< R,  4, 12 > PARTNO;        /**< [15: 4] Number of processor within family        */
      typedef RegisterBits< R, 16,  4 > Constant;      /**< [19:16] Reads as 0x0F                            */
      typedef RegisterBits< R, 20,  4 > VARIANT;       /**< [23:20] Implementation defined variant number    */
      typedef RegisterBits< R, 24,  8 > IMPLEMENTER;   /**< [31:24] Implementer code. ARM is 0x41            */
    };

    /**
     * Interrupt Control and State Register
     */
    template<typename R>
    struct __ICSR
    : public R
    {
      typedef RegisterBits< R,  0,  9 > VECTACTIVE;    /**< [ 8: 0] Active ISR number field                                                          */
      typedef RegisterBits< R, 11,  1 > RETTOBASE;     /**< [11:11] All active exceptions minus the IPSR_current_exception yields the empty set      */
      typedef RegisterBits< R, 12, 10 > VECTPENDING;   /**< [21:12] Pending ISR number field                                                         */
      typedef RegisterBits< R, 22,  1 > ISRPENDING;    /**< [22:22] Interrupt pending flag                                                           */
      typedef RegisterBits< R, 23,  1 > ISRPREEMPT;    /**< [23:23] It indicates that a pending interrupt becomes active in the next running cycle   */
      typedef RegisterBits< R, 25,  1 > PENDSTCLR;     /**< [25:25] Clear pending SysTick bit                                                        */
      typedef RegisterBits< R, 26,  1 > PENDSTSET;     /**< [26:26] Set pending SysTick bit                                                          */
      typedef RegisterBits< R, 27,  1 > PENDSVCLR;     /**< [27:27] Clear pending pendSV bit                                                         */
      typedef RegisterBits< R, 28,  1 > PENDSVSET;     /**< [28:28] Set pending pendSV bit                                                           */
      typedef RegisterBits< R, 31,  1 > NMIPENDSET;    /**< [31:31] Set pending NMI bit                                                              */
    };

    /**
     * Vector Table Offset Register
     */
    template<typename R>
    struct __VTOR
    : public R
    {
      typedef RegisterBits< R,  7, 22 > TBLOFF;        /**< [28: 7] Vector table base offset field    */
      typedef RegisterBits< R, 29,  1 > TBLBASE;       /**< [29:29] Table base in code(0) or RAM(1)   */
    };

    /**
     * Application Interrupt and Reset Control Register
     */
    template<typename R>
    struct __AIRCR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > VECTRESET;     /**< [ 0: 0] System Reset bit                                         */
      typedef RegisterBits< R,  1,  1 > VECTCLRACTIVE; /**< [ 1: 1] Clear active vector bit                                  */
      typedef RegisterBits< R,  2,  1 > SYSRESETREQ;   /**< [ 2: 2] Requests chip control logic to generate a reset          */
      typedef RegisterBits< R,  8,  3 > PRIGROUP;      /**< [10: 8] Priority group                                           */
      typedef RegisterBits< R, 15,  1 > ENDIANESS;     /**< [15:15] Data endianness bit                                      */
      typedef RegisterBits< R, 16, 16 > VECTKEY;       /**< [31:16] Register key (VECTKEY) - Reads as 0xFA05 (VECTKEYSTAT)   */
    };

    /**
     * System Control Register
     */
    template<typename R>
    struct __SCR
    : public R
    {
      typedef RegisterBits< R,  1,  1 > SLEEPONEXIT;   /**< [ 1: 1] Sleep on exit bit   */
      typedef RegisterBits< R,  2,  1 > SLEEPDEEP;     /**< [ 2: 2] Sleep deep bit      */
      typedef RegisterBits< R,  4,  1 > SEVONPEND;     /**< [ 4: 4] Wake up from WFE    */
    };

    /**
     * Configuration and Control Register
     */
    template<typename R>
    struct __CCR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > NONBASETHRDENA; /**< [ 0: 0] Thread mode can be entered from any level in Handler mode by controlled return value                    */
      typedef RegisterBits< R,  1,  1 > USERSETMPEND;   /**< [ 1: 1] Enables user code to write the Software Trigger Interrupt register to trigger (pend) a Main exception   */
      typedef RegisterBits< R,  3,  1 > UNALIGN_TRP;    /**< [ 3: 3] Trap for unaligned access                                                                               */
      typedef RegisterBits< R,  4,  1 > DIV_0_TRP;      /**< [ 4: 4] Trap on Divide by 0                                                                                     */
      typedef RegisterBits< R,  8,  1 > BFHFNMIGN;      /**< [ 8: 8] Handlers running at priority -1 and -2                                                                  */
      typedef RegisterBits< R,  9,  1 > STKALIGN;       /**< [ 9: 9] On exception entry, the SP used prior to the exception is adjusted to be 8-byte aligned                 */
    };

    /**
     * System Handler Priority Register
     */
    template<typename R>
    struct __SHPR
    : public R
    {
      // TODO: magic template for PRI_xx
      typedef RegisterBits< R,  0,  8 > PRI_N;         /**< [ 7: 0] Priority of system handler 4,8, and 12. Mem Manage, reserved and Debug Monitor   */
      typedef RegisterBits< R,  8,  8 > PRI_N1;        /**< [15: 8] Priority of system handler 5,9, and 13. Bus Fault, reserved and reserved         */
      typedef RegisterBits< R, 16,  8 > PRI_N2;        /**< [23:16] Priority of system handler 6,10, and 14. Usage Fault, reserved and PendSV        */
      typedef RegisterBits< R, 24,  8 > PRI_N3;        /**< [31:24] Priority of system handler 7,11, and 15. Reserved, SVCall and SysTick            */
    };

    /**
     * System Handler Control and State Register
     */
    template<typename R>
    struct __SHCSR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > MEMFAULTACT;    /**< [ 0: 0] MemManage is active     */
      typedef RegisterBits< R,  1,  1 > BUSFAULTACT;    /**< [ 1: 1] BusFault is active      */
      typedef RegisterBits< R,  3,  1 > USGFAULTACT;    /**< [ 3: 3] UsageFault is active    */
      typedef RegisterBits< R,  7,  1 > SVCALLACT;      /**< [ 7: 7] SVCall is active        */
      typedef RegisterBits< R,  8,  1 > MONITORACT;     /**< [ 8: 8] Monitor is active       */
      typedef RegisterBits< R, 10,  1 > PENDSVACT;      /**< [10:10] PendSV is active        */
      typedef RegisterBits< R, 11,  1 > SYSTICKACT;     /**< [11:11] SysTick is active       */
      typedef RegisterBits< R, 12,  1 > USGFAULTPENDED; /**< [12:12] Usage Fault is pended   */
      typedef RegisterBits< R, 13,  1 > MEMFAULTPENDED; /**< [13:13] MemManage is pended     */
      typedef RegisterBits< R, 14,  1 > BUSFAULTPENDED; /**< [14:14] Bus Fault is pended     */
      typedef RegisterBits< R, 15,  1 > SVCALLPENDED;   /**< [15:15] SVCall is pended        */
      typedef RegisterBits< R, 16,  1 > MEMFAULTENA;    /**< [16:16] MemManage enable        */
      typedef RegisterBits< R, 17,  1 > BUSFAULTENA;    /**< [17:17] Bus Fault enable        */
      typedef RegisterBits< R, 18,  1 > USGFAULTENA;    /**< [18:18] UsageFault enable       */
    };

    /**
     * Configurable Fault Status Registers
     */
    template<typename R>
    struct __CFSR
    : public R
    {
      /* MFSR */
      // TODO: byte-accessible registers
      // RegisterBits< R,  0,  8 > MFSR;
      // RegisterBits< R,  8, 16 > BFSR;
      // RegisterBits< R, 16, 16 > UFSR;
      typedef RegisterBits< R,  0,  1 > IACCVIOL;      /**< [ 0: 0] Instruction access violation   */
      typedef RegisterBits< R,  1,  1 > DACCVIOL;      /**< [ 1: 1] Data access violation          */
      typedef RegisterBits< R,  3,  1 > MUNSTKERR;     /**< [ 3: 3] Unstacking error               */
      typedef RegisterBits< R,  4,  1 > MSTKERR;       /**< [ 4: 4] Stacking error                 */
      /* BFSR */
      typedef RegisterBits< R,  8,  1 > IBUSERR;       /**< [ 8: 8] Instruction bus error flag                      */
      typedef RegisterBits< R,  9,  1 > PRECISERR;     /**< [ 9: 9] Precise data bus error                          */
      typedef RegisterBits< R, 10,  1 > IMPRECISERR;   /**< [10:10] Imprecise data bus error                        */
      typedef RegisterBits< R, 11,  1 > UNSTKERR;      /**< [11:11] Unstacking error                                */
      typedef RegisterBits< R, 12,  1 > STKERR;        /**< [12:12] Stacking error                                  */
      typedef RegisterBits< R, 15,  1 > BFARVALID;     /**< [15:15] Bus Fault Address Register address valid flag   */
      /* UFSR */
      typedef RegisterBits< R, 16,  1 > UNDEFINSTR;    /**< [16:16] The processor attempt to excecute an undefined instruction                 */
      typedef RegisterBits< R, 17,  1 > INVSTATE;      /**< [17:17] Invalid combination of EPSR and instruction                                */
      typedef RegisterBits< R, 18,  1 > INVPC;         /**< [18:18] Attempt to load EXC_RETURN into pc illegally                               */
      typedef RegisterBits< R, 19,  1 > NOCP;          /**< [19:19] Attempt to use a coprocessor instruction                                   */
      typedef RegisterBits< R, 24,  1 > UNALIGNED;     /**< [24:24] Fault occurs when there is an attempt to make an unaligned memory access   */
      typedef RegisterBits< R, 25,  1 > DIVBYZERO;     /**< [25:25] Fault occurs when SDIV or DIV instruction is used with a divisor of 0      */
    };

    /**
     * HardFault Status Register
     */
    template<typename R>
    struct __HFSR
    : public R
    {
      typedef RegisterBits< R,  1,  1 > VECTTBL;       /**< [ 1: 1] Fault occures because of vector table read on exception processing                */
      typedef RegisterBits< R, 30,  1 > FORCED;        /**< [30:30] Hard Fault activated when a configurable Fault was received and cannot activate   */
      typedef RegisterBits< R, 31,  1 > DEBUGEVT;      /**< [31:31] Fault related to debug                                                            */
    };

    /**
     * Debug Fault Status Register
     */
    template<typename R>
    struct __DFSR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > HALTED;        /**< [ 0: 0] Halt request flag                      */
      typedef RegisterBits< R,  1,  1 > BKPT;          /**< [ 1: 1] BKPT flag                              */
      typedef RegisterBits< R,  2,  1 > DWTTRAP;       /**< [ 2: 2] Data Watchpoint and Trace (DWT) flag   */
      typedef RegisterBits< R,  3,  1 > VCATCH;        /**< [ 3: 3] Vector catch flag                      */
      typedef RegisterBits< R,  4,  1 > EXTERNAL;      /**< [ 4: 4] External debug request flag            */
    };

