digint/openmptl/arch/arm/cortex-m3/stm32f10x/include/arch/core_reg.hpp
  public:

    typedef          Register< uint32_t, 0xE000E008, access::rw >   ACTLR; /**< Auxiliary Control Register, ACTLR   */
    typedef __STCSR< Register< uint32_t, 0xE000E010, access::rw > > STCSR;
    typedef          Register< uint32_t, 0xE000E014, access::rw >   STRVR; /**< SysTick Reload Value Register        */
    typedef          Register< uint32_t, 0xE000E018, access::rw >   STCVR; /**< SysTick Current Value Register   */
    typedef __STCR < Register< uint32_t, 0xE000E01C, access::ro > > STCR;
    typedef __CPUID< Register< uint32_t, 0xE000ED00, access::ro, 0x412FC231 > > CPUID;
    typedef __ICSR < Register< uint32_t, 0xE000ED04, access::rw > > ICSR;
    typedef __VTOR < Register< uint32_t, 0xE000ED08, access::rw > > VTOR;
    typedef __AIRCR< Register< uint32_t, 0xE000ED0C, access::rw > > AIRCR;
    typedef __SCR  < Register< uint32_t, 0xE000ED10, access::rw > > SCR;
    typedef __CCR  < Register< uint32_t, 0xE000ED14, access::rw, 0x00000200 > > CCR; // TODO: 16-bit

    template<std::size_t index>
    struct SHPR
    : __SHPR < Register< uint32_t, 0xE000ED18 + 4 * index, access::rw > >
    { static_assert(index < 3, "invalid index for register"); };

    typedef __SHCSR< Register< uint32_t, 0xE000ED24, access::rw > > SHCSR;
    typedef __CFSR < Register< uint32_t, 0xE000ED28, access::rw > > CFSR;
    typedef __HFSR < Register< uint32_t, 0xE000ED2C, access::rw > > HFSR;
    typedef __DFSR < Register< uint32_t, 0xE000ED30, access::rw > > DFSR;
    typedef          Register< uint32_t, 0xE000ED34, access::rw             > MMFAR;    /**< MemManage Fault Address Register[b]     */
    typedef          Register< uint32_t, 0xE000ED38, access::rw             > BFAR;     /**< BusFault Address Register[b]            */
    typedef          Register< uint32_t, 0xE000ED3C, access::rw             > AFSR;     /**< Auxiliary Fault Status Register, AFSR   */
    typedef          Register< uint32_t, 0xE000ED40, access::ro, 0x00000030 > ID_PFR0;  /**< Processor Feature Register 0            */
    typedef          Register< uint32_t, 0xE000ED44, access::ro, 0x00000200 > ID_PFR1;  /**< Processor Feature Register 1            */
    typedef          Register< uint32_t, 0xE000ED48, access::ro, 0x00100000 > ID_DFR0;  /**< Debug Features Register 0[c]            */
    typedef          Register< uint32_t, 0xE000ED4C, access::ro             > ID_AFR0;  /**< Auxiliary Features Register 0           */
    typedef          Register< uint32_t, 0xE000ED50, access::ro, 0x00100030 > ID_MMFR0; /**< Memory Model Feature Register 0         */
    typedef          Register< uint32_t, 0xE000ED54, access::ro             > ID_MMFR1; /**< Memory Model Feature Register 1         */
    typedef          Register< uint32_t, 0xE000ED58, access::ro, 0x01000000 > ID_MMFR2; /**< Memory Model Feature Register 2         */
    typedef          Register< uint32_t, 0xE000ED5C, access::ro             > ID_MMFR3; /**< Memory Model Feature Register 3         */
    typedef          Register< uint32_t, 0xE000ED60, access::ro, 0x01100110 > ID_ISAR0; /**< Instruction Set Attributes Register 0   */
    typedef          Register< uint32_t, 0xE000ED64, access::ro, 0x02111000 > ID_ISAR1; /**< Instruction Set Attributes Register 1   */
    typedef          Register< uint32_t, 0xE000ED68, access::ro, 0x21112231 > ID_ISAR2; /**< Instruction Set Attributes Register 2   */
    typedef          Register< uint32_t, 0xE000ED6C, access::ro, 0x01111110 > ID_ISAR3; /**< Instruction Set Attributes Register 3   */
    typedef          Register< uint32_t, 0xE000ED70, access::ro, 0x01310132 > ID_ISAR4; /**< Instruction Set Attributes Register 4   */
    typedef          Register< uint32_t, 0xE000ED88, access::rw             > CPACR;    /**< Coprocessor Access Control Register     */
    typedef          Register< uint32_t, 0xE000EF00, access::wo             > STIR;     /**< Software Triggered Interrupt Register   */
  };



  /**
   *  MPU (Memory Protection Unit) Register
   *
   * Imported from the Cortex-M3 Technical Reference Manual  (Revision: r2p1)
   * <http://infocenter.arm.com/help/topic/com.arm.doc.subset.cortexm.m3/index.html>
   */
  struct MPU
  {
    typedef   Register< uint32_t, 0xE000ED90, access::ro, 0x00000800 > TYPE;    /**< MPU Type Register                        */
    typedef   Register< uint32_t, 0xE000ED94, access::rw             > CTRL;    /**< MPU Control Register                     */
    typedef   Register< uint32_t, 0xE000ED98, access::rw             > RNR;     /**< MPU Region Number Register               */
    typedef   Register< uint32_t, 0xE000ED9C, access::rw             > RBAR;    /**< MPU Region Base Address Register         */
    typedef   Register< uint32_t, 0xE000EDA0, access::rw             > RASR;    /**< MPU Region Attribute and Size Register   */
    typedef   Register< uint32_t, 0xE000EDA4, access::rw             > RBAR_A1; /**< MPU alias registers                      */
    typedef   Register< uint32_t, 0xE000EDA8, access::rw             > RASR_A1; /**<                                          */
    typedef   Register< uint32_t, 0xE000EDAC, access::rw             > RBAR_A2; /**<                                          */
    typedef   Register< uint32_t, 0xE000EDB0, access::rw             > RASR_A2; /**<                                          */
    typedef   Register< uint32_t, 0xE000EDB4, access::rw             > RBAR_A3; /**<                                          */
    typedef   Register< uint32_t, 0xE000EDB8, access::rw             > RASR_A3; /**<                                          */
  };



  /**
   *  NVIC (Nested Vectored Interrupt Controller) Register
   *
   * Imported from the Cortex-M3 Technical Reference Manual  (Revision: r2p1)
   * <http://infocenter.arm.com/help/topic/com.arm.doc.subset.cortexm.m3/index.html>
   */
  struct NVIC
  {
    /** Interrupt Controller Type Register */
    typedef Register< uint32_t, 0xE000E004, access::ro > ICTR;

    // TODO: The following registers are actually only 8bit wide.
    //       Check if access is better using 32bit or 8bit pointer

    /** Interrupt Set-Enable Registers */
    template<std::size_t index>
    struct ISER
    : Register<uint32_t, 0xE000E100 + 4 * index, access::rw >
    { static_assert(index < 8, "invalid index for register"); };

    /** Interrupt Set-Enable Registers */
    template<std::size_t index>
    struct ICER : Register<uint32_t, 0xE000E180 + 4 * index, access::rw >
    { static_assert(index < 8, "invalid index for register"); };

