digint/openmptl/arch/arm/cortex-m3/stm32f10x/include/arch/core_reg.hpp
    /** Interrupt Set-Pending Registers */
    template<std::size_t index>
    struct ISPR : Register<uint32_t, 0xE000E200 + 4 * index, access::rw >
    { static_assert(index < 8, "invalid index for register"); };

    /** Interrupt Clear-Pending Registers */
    template<std::size_t index>
    struct ICPR : Register<uint32_t, 0xE000E280 + 4 * index, access::rw >
    { static_assert(index < 8, "invalid index for register"); };

    /** Interrupt Active Bit Register */
    template<std::size_t index>
    struct IABR : Register<uint32_t, 0xE000E300 + 4 * index, access::ro >
    { static_assert(index < 8, "invalid index for register"); };

   /** Interrupt Priority Register */
    template<std::size_t index>
    struct IPR  : Register<uint32_t, 0xE000E400 + 4 * index, access::rw >
    { static_assert(index < 60, "invalid index for register"); };
  };
};



////////////////////  PeripheralRegister  ////////////////////



struct PeripheralRegister {

  static constexpr reg_addr_t PERIPH_BASE = 0x40000000;
  static constexpr reg_addr_t APB1_BASE   = PERIPH_BASE;
  static constexpr reg_addr_t APB2_BASE   = PERIPH_BASE + 0x10000;
  static constexpr reg_addr_t AHB_BASE    = PERIPH_BASE + 0x20000;

  using access = RegisterAccess;


  /**
   * Reset and clock control (RCC)
   */
  class RCC
  {
    static constexpr reg_addr_t reg_base = AHB_BASE + 0x1000;

    /**
     * Clock control register
     */
    template<typename R>
    struct __CR
    : public R
    {
      // TODO: some (!) here are read-only bits
      typedef RegisterBits< R,  0,  1 > HSION;         /**< [ 0: 0] Internal High Speed clock enable        */
      typedef RegisterBits< R,  1,  1 > HSIRDY;        /**< [ 1: 1] Internal High Speed clock ready flag    */
      typedef RegisterBits< R,  3,  5 > HSITRIM;       /**< [ 7: 3] Internal High Speed clock trimming      */
      typedef RegisterBits< R,  8,  8 > HSICAL;        /**< [15: 8] Internal High Speed clock Calibration   */
      typedef RegisterBits< R, 16,  1 > HSEON;         /**< [16:16] External High Speed clock enable        */
      typedef RegisterBits< R, 17,  1 > HSERDY;        /**< [17:17] External High Speed clock ready flag    */
      typedef RegisterBits< R, 18,  1 > HSEBYP;        /**< [18:18] External High Speed clock Bypass        */
      typedef RegisterBits< R, 19,  1 > CSSON;         /**< [19:19] Clock Security System enable            */
      typedef RegisterBits< R, 24,  1 > PLLON;         /**< [24:24] PLL enable                              */
      typedef RegisterBits< R, 25,  1 > PLLRDY;        /**< [25:25] PLL clock ready flag                    */

#ifdef STM32F10X_CL
      typedef RegisterBits< R, 26,  1 > PLL2ON;        /**< [26:26] PLL2 enable             */
      typedef RegisterBits< R, 27,  1 > PLL2RDY;       /**< [27:27] PLL2 clock ready flag   */
      typedef RegisterBits< R, 28,  1 > PLL3ON;        /**< [28:28] PLL3 enable             */
      typedef RegisterBits< R, 29,  1 > PLL3RDY;       /**< [29:29] PLL3 clock ready flag   */
#endif /* STM32F10X_CL */
    };


    /*
     *  Clock configuration register
     */
    template<typename R>
    class __CFGR
    : public R
    {
      /** System clock Switch  */
      template<typename Rb>
      struct __SW
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > HSI;          /**< 00: HSI selected as system clock   */
        typedef RegisterConst< Rb, 0x1 > HSE;          /**< 01: HSE selected as system clock   */
        typedef RegisterConst< Rb, 0x2 > PLL;          /**< 10: PLL selected as system clock   */
      };

      /** System clock Switch Status  */
      template<typename Rb>
      struct __SWS
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > HSI;          /**< 00: HSI oscillator used as system clock   */
        typedef RegisterConst< Rb, 0x1 > HSE;          /**< 01: HSE oscillator used as system clock   */
        typedef RegisterConst< Rb, 0x2 > PLL;          /**< 02: PLL used as system clock              */
      };

      /** AHB prescaler  */
      template<typename Rb>
      struct __HPRE
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > DIV1;         /**< 0xxx: SYSCLK not divided      */
        typedef RegisterConst< Rb, 0x8 > DIV2;         /**< 1000: SYSCLK divided by 2     */
        typedef RegisterConst< Rb, 0x9 > DIV4;         /**< 1001: SYSCLK divided by 4     */
        typedef RegisterConst< Rb, 0xA > DIV8;         /**< 1010: SYSCLK divided by 8     */
        typedef RegisterConst< Rb, 0xB > DIV16;        /**< 1011: SYSCLK divided by 16    */
        typedef RegisterConst< Rb, 0xC > DIV64;        /**< 1100: SYSCLK divided by 64    */
        typedef RegisterConst< Rb, 0xD > DIV128;       /**< 1101: SYSCLK divided by 128   */
        typedef RegisterConst< Rb, 0xE > DIV256;       /**< 1110: SYSCLK divided by 256   */
        typedef RegisterConst< Rb, 0xF > DIV512;       /**< 1111: SYSCLK divided by 512   */
      };

      /** APB1/2 prescaler  */
      template<typename Rb>
      struct __PPREx
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > DIV1;         /**< 0xx: HCLK not divided     */
        typedef RegisterConst< Rb, 0x4 > DIV2;         /**< 100: HCLK divided by 2    */
        typedef RegisterConst< Rb, 0x5 > DIV4;         /**< 101: HCLK divided by 4    */
        typedef RegisterConst< Rb, 0x6 > DIV8;         /**< 110: HCLK divided by 8    */
        typedef RegisterConst< Rb, 0x7 > DIV16;        /**< 111: HCLK divided by 16   */
      };

      /** ADC prescaler  */
      template<typename Rb>
      struct __ADCPRE
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > DIV2;         /**< 00: PCLK2 divided by 2   */
        typedef RegisterConst< Rb, 0x1 > DIV4;         /**< 01: PCLK2 divided by 4   */
        typedef RegisterConst< Rb, 0x2 > DIV6;         /**< 10: PCLK2 divided by 6   */
        typedef RegisterConst< Rb, 0x3 > DIV8;         /**< 11: PCLK2 divided by 8   */
      };

      /** PLL entry clock source  */
      template<typename Rb>
      struct __PLLSRC
      : public Rb
      {
        typedef RegisterConst< Rb, 0x0 > HSI_DIV2;     /**< 00: HSI clock divided by 2 selected as PLL input clock   */
#ifdef STM32F10X_CL
        typedef RegisterConst< Rb, 0x1 > PREDIV1;      /**< 01: Clock from PREDIV1 selected as PLL input clock   */
#else
        typedef RegisterConst< Rb, 0x1 > HSE;          /**< 01: HSE oscillator clock selected as PLL input clock   */
#endif
      };

      /** 
       * - LSB of division factor PREDIV1 (Connectivity Line Devices)
       * - HSE divider for PLL entry (Low-, medium-, high- and XL-density Devices)
       */
      template<typename Rb>
      struct __PLLXTPRE
      : public Rb
      {
#ifdef STM32F10X_CL
        typedef RegisterConst< Rb, 0x0 > PREDIV1;      /**< 00: PREDIV1 clock not divided for PLL entry    */
        typedef RegisterConst< Rb, 0x1 > PREDIV1_DIV2; /**< 01: PREDIV1 clock divided by 2 for PLL entry   */
#else
        typedef RegisterConst< Rb, 0x0 > HSE;          /**< 00: HSE clock not divided    */
        typedef RegisterConst< Rb, 0x1 > HSE_DIV2;     /**< 01: HSE clock divided by 2   */
#endif
      };

