digint/openmptl/arch/arm/cortex-m3/stm32f10x/include/arch/core_reg.hpp
  public:

    typedef __SR   < Register< uint32_t, reg_base + 0x00, access::rw > > SR;
    typedef __CR1  < Register< uint32_t, reg_base + 0x04, access::rw > > CR1;
    typedef __CR2  < Register< uint32_t, reg_base + 0x08, access::rw > > CR2;
    typedef __SMPR1< Register< uint32_t, reg_base + 0x0c, access::rw > > SMPR1;
    typedef __SMPR2< Register< uint32_t, reg_base + 0x10, access::rw > > SMPR2;

    template<std::size_t jofr_no>
    struct JOFR
    : __JOFR<Register< uint32_t, reg_base + 0x14 + (jofr_no - 1) * 4, access::rw >>
    { static_assert((jofr_no >= 1) && (jofr_no <= 4), "invalid index for register"); };

    typedef __HTR  < Register< uint32_t, reg_base + 0x24, access::rw, 0x00000FFF > > HTR;
    typedef __LTR  < Register< uint32_t, reg_base + 0x28, access::rw             > > LTR;
    typedef __SQR1 < Register< uint32_t, reg_base + 0x2c, access::rw             > > SQR1;
    typedef __SQR2 < Register< uint32_t, reg_base + 0x30, access::rw             > > SQR2;
    typedef __SQR3 < Register< uint32_t, reg_base + 0x34, access::rw             > > SQR3;
    typedef __JSQR < Register< uint32_t, reg_base + 0x38, access::rw             > > JSQR;

    template<std::size_t jdr_no>
    struct JDR
    : __JDR<Register< uint32_t, reg_base + 0x3c + (jdr_no - 1) * 4, access::ro >>
    { static_assert((jdr_no >= 1) && (jdr_no <= 4), "invalid index for register"); };

    typedef __DR   < Register< uint32_t, reg_base + 0x4c, access::ro > > DR;
  };                                                    


  /**
   * Serial peripheral interface (SPI)
   *
   * Note that the registers are actually only 16bit wide, but accessing
   * them with 32bit is faster in general.
   */
  template<std::size_t spi_no>
  class SPI
  {
    static_assert((spi_no >= 1) && (spi_no <= 3), "invalid SPI number"); // TODO: depends on cpu sub-arch

    using access = RegisterAccess;

    static constexpr reg_addr_t reg_base = spi_no == 1 ? PeripheralRegister::APB2_BASE + 0x3000 :
                                           spi_no == 2 ? PeripheralRegister::APB1_BASE + 0x3800 :
                                           spi_no == 3 ? PeripheralRegister::APB1_BASE + 0x3C00 :
                                           0;

    /** SPI control register 1 */
    template<typename R>
    class __CR1
    : public R
    {

      /** Baud Rate Control  */
      template<typename Rb>
      struct __BR
      : public Rb
      {
        template<unsigned prescaler>
        struct Prescaler
        : RegisterConst< Rb,
                         prescaler == 2   ? 0x0 :      /**< f_PCLK / 2     */
                         prescaler == 4   ? 0x1 :      /**< f_PCLK / 4     */
                         prescaler == 8   ? 0x2 :      /**< f_PCLK / 8     */
                         prescaler == 16  ? 0x3 :      /**< f_PCLK / 16    */
                         prescaler == 32  ? 0x4 :      /**< f_PCLK / 32    */
                         prescaler == 64  ? 0x5 :      /**< f_PCLK / 64    */
                         prescaler == 128 ? 0x6 :      /**< f_PCLK / 128   */
                         prescaler == 256 ? 0x7 :      /**< f_PCLK / 256   */
                         0
                         >
        {
          static_assert(prescaler == 2  || prescaler == 4  || prescaler == 8   || prescaler == 16 ||
                        prescaler == 32 || prescaler == 64 || prescaler == 128 || prescaler == 256
                        , "invalid baud rate prescaler");
        };
      };

    public:

      typedef        RegisterBits< R,  0,  1 >   CPHA;     /**< [ 0: 0] Clock Phase                           */
      typedef        RegisterBits< R,  1,  1 >   CPOL;     /**< [ 1: 1] Clock Polarity                        */
      typedef        RegisterBits< R,  2,  1 >   MSTR;     /**< [ 2: 2] Master Selection                      */
      typedef __BR < RegisterBits< R,  3,  3 > > BR;       /**< [ 5: 3] Baud Rate Control                     */
      typedef        RegisterBits< R,  6,  1 >   SPE;      /**< [ 6: 6] SPI Enable                            */
      typedef        RegisterBits< R,  7,  1 >   LSBFIRST; /**< [ 7: 7] Frame Format                          */
      typedef        RegisterBits< R,  8,  1 >   SSI;      /**< [ 8: 8] Internal slave select                 */
      typedef        RegisterBits< R,  9,  1 >   SSM;      /**< [ 9: 9] Software slave management             */
      typedef        RegisterBits< R, 10,  1 >   RXONLY;   /**< [10:10] Receive only                          */
      typedef        RegisterBits< R, 11,  1 >   DFF;      /**< [11:11] Data Frame Format                     */
      typedef        RegisterBits< R, 12,  1 >   CRCNEXT;  /**< [12:12] Transmit CRC next                     */
      typedef        RegisterBits< R, 13,  1 >   CRCEN;    /**< [13:13] Hardware CRC calculation enable       */
      typedef        RegisterBits< R, 14,  1 >   BIDIOE;   /**< [14:14] Output enable in bidirectional mode   */
      typedef        RegisterBits< R, 15,  1 >   BIDIMODE; /**< [15:15] Bidirectional data mode enable        */
    };

    /** SPI control register 2 */
    template<typename R>
    struct __CR2
    : public R
    {
      typedef RegisterBits< R,  0,  1 > RXDMAEN;       /**< [ 0: 0] Rx Buffer DMA Enable                   */
      typedef RegisterBits< R,  1,  1 > TXDMAEN;       /**< [ 1: 1] Tx Buffer DMA Enable                   */
      typedef RegisterBits< R,  2,  1 > SSOE;          /**< [ 2: 2] SS Output Enable                       */
      typedef RegisterBits< R,  5,  1 > ERRIE;         /**< [ 5: 5] Error Interrupt Enable                 */
      typedef RegisterBits< R,  6,  1 > RXNEIE;        /**< [ 6: 6] RX buffer Not Empty Interrupt Enable   */
      typedef RegisterBits< R,  7,  1 > TXEIE;         /**< [ 7: 7] Tx buffer Empty Interrupt Enable       */
    };

    /** SPI status register */
    template<typename R>
    struct __SR
    : public R
    {
      typedef RegisterBits< R,  0,  1 > RXNE;          /**< [ 0: 0] Receive buffer Not Empty   */
      typedef RegisterBits< R,  1,  1 > TXE;           /**< [ 1: 1] Transmit buffer Empty      */
      typedef RegisterBits< R,  2,  1 > CHSIDE;        /**< [ 2: 2] Channel side               */
      typedef RegisterBits< R,  3,  1 > UDR;           /**< [ 3: 3] Underrun flag              */
      typedef RegisterBits< R,  4,  1 > CRCERR;        /**< [ 4: 4] CRC Error flag             */
      typedef RegisterBits< R,  5,  1 > MODF;          /**< [ 5: 5] Mode fault                 */
      typedef RegisterBits< R,  6,  1 > OVR;           /**< [ 6: 6] Overrun flag               */
      typedef RegisterBits< R,  7,  1 > BSY;           /**< [ 7: 7] Busy flag                  */
    };
    
